[{"Roll":1,"Name":"Braid's Cabal","Description":"Each player sacrifices a creature, enchantment, or artifact during their upkeep."},{"Roll":2,"Name":"Topsy Turvy","Description":"Flying creatures lose flying. Non-flying creatures gain flying."},{"Roll":3,"Name":"Dominaria's Land Exchange","Description":"Any player may pay 2 and sacrifice a land to draw a card."},{"Roll":4,"Name":"Eye of Singularity","Description":"Any time a spell is played, counter that spell if there is a card with the same name in that player's graveyard."},{"Roll":5,"Name":"Urza's Flour Mill","Description":"During each player's upkeep, that player puts the top two cards of their library into the graveyard."},{"Roll":6,"Name":"Crossroads of the Dead","Description":"Whenever a creature is put into the graveyard from play, that creature's controller may pay 4 to return it to their hand."},{"Roll":7,"Name":"Tolarian Laboratory","Description":"All instants and sorceries gain: Buyback: Sacrifice a land and pay 5."},{"Roll":8,"Name":"Orc War Camp","Description":"Attacking creatures get +1/+0."},{"Roll":9,"Name":"Serra's Sanctuary","Description":"Blocking creatures get +0/+2."},{"Roll":10,"Name":"Plagued Existance","Description":"Both players pick a creature type when this world is rolled. Creatures of that type get -1/-1."},{"Roll":11,"Name":"Anthem of the Mighty","Description":"Each player picks a creature type when this world is rolled. Creatures of that type get +1/+1."},{"Roll":12,"Name":"Zombie Cafeteria","Description":"During each player's upkeep, that player removes a card in the graveyard from the game."},{"Roll":13,"Name":"Deja Vu","Description":"All sorceries and instants gain Flashback:7."},{"Roll":14,"Name":"Mine Field","Description":"Any player may pay 6 to destroy a creature."},{"Roll":15,"Name":"Ruin of Crosis","Description":"Any player may pay 4 to make another player discard a card. This ability may only be used as a sorcery."},{"Roll":16,"Name":"Fertile Valley","Description":"Whenever a player taps a land for mana, that land produces an additional mana of the same color."},{"Roll":17,"Name":"Ertai's Dominion","Description":"Permanents may not be the target of spells or effects."},{"Roll":18,"Name":"Orim's Sanctuary","Description":"Whenever a creature or player is damaged by a source, reduce that damage by one."},{"Roll":19,"Name":"Barbed Forest","Description":"Whenever a player or creature is damaged by a source, increase that damage by one."},{"Roll":20,"Name":"Viashivan Geyser","Description":"All creatures gain haste. At the end of each turn, return all creatures to their owner's hand."},{"Roll":21,"Name":"Library of Tolaria","Description":"Any player may pay 4 to draw a card."},{"Roll":22,"Name":"Telepathic Chambers","Description":"All players play with their hands revealed."},{"Roll":23,"Name":"Ice Cave","Description":"Whenever a player plays a spell, any player may pay the same specific casting cost (including color) to counter that spell."},{"Roll":24,"Name":"Phyrexian Mine","Description":"Each player draws an extra card during their draw phase."},{"Roll":25,"Name":"Unexplored Territory","Description":"Players may play one additional land per turn."},{"Roll":26,"Name":"Poppy Fields","Description":"Maximum hand size is reduced by three."},{"Roll":27,"Name":"Endless Horizons","Description":"There is no maximum hand size."},{"Roll":28,"Name":"Temporal Canyon","Description":"All creatures gain Echo."},{"Roll":29,"Name":"Power Flux","Description":"Artifacts and enchantments gain Cumulative Upkeep:1."},{"Roll":30,"Name":"Rampart War Zone","Description":"All creatures gain Trample."},{"Roll":31,"Name":"Urza's Dart Competition","Description":"Any player may pay 4 to do 1 damage to any creature or player."},{"Roll":32,"Name":"Awakened Forest","Description":"Lands are also 1/1 creatures that still count as lands."},{"Roll":33,"Name":"Bureaucratic Interference","Description":"Whenever a spell with one target is played, any player may pay 5 to change it's target."},{"Roll":34,"Name":"Mirari","Description":"Whenever a player plays a sorcery or instant, that player may pay 4 to put a copy of that spell onto the stack with different targets."},{"Roll":35,"Name":"Phyrexian Tar Pits","Description":"Creatures don't untap as normal. Any player may pay 2 to untap a creature."},{"Roll":36,"Name":"Hermit's Cabin","Description":"Any player may pay 4 during their main phase to put a 1/1 squirrel token into play."},{"Roll":37,"Name":"Wastelands","Description":"Players may untap only 2 lands a turn."},{"Roll":38,"Name":"Vale of Locusts","Description":"During each player's upkeep, that player puts a X/X green locust token into play, with power and toughness each equal to the number of locust tokens they control. Any player may pay two to prevent this."},{"Roll":39,"Name":"Phyrexian Armory","Description":"Any player may sacrifice a creature to give another creature a +1/+1 counter."},{"Roll":40,"Name":"Dwarven Armory","Description":"Any player sacrifice a land to give a creature a +1/+1 counter."},{"Roll":41,"Name":"Patriarch's Curse","Description":"Any player may sacrifice a creature or land to give another creature a -1/-1 counter."},{"Roll":42,"Name":"Rainbow Sanctum","Description":"All creatures gain protection from their own color(s)."},{"Roll":43,"Name":"Experimental Lab","Description":"Any player may pay 2 to have target creature gain: Flying, First Strike, or Trample until end of turn."},{"Roll":44,"Name":"Engineered Pestilence","Description":"Any player may pay 2 to have target creature lose: Flying, First Strike, or Trample until end of turn."},{"Roll":45,"Name":"The Heart of Yavimaya","Description":"All creatures gain \"3:Regenerate\"."},{"Roll":46,"Name":"Mercenary Camp","Description":"All creatures gain \"3:This creature gets +1/+1 until end of turn\"."},{"Roll":47,"Name":"Phyrexian Forge","Description":"During each player's upkeep, that player may choose First Strike, Trample, or a +1/+1 counter. They may give that ability permanently to a creature."},{"Roll":48,"Name":"Magma Fields","Description":"Player's may sacrifice a land to do a point of damage to target creature or player."},{"Roll":49,"Name":"Healing Ground","Description":"Players may sacrifice a land to gain 2 life."},{"Roll":50,"Name":"Memory Field","Description":"Whenever a permanent is put into a graveyard, that permanent's controller may pay 3 to search their library for a copy of that card and put it into their hand."},{"Roll":51,"Name":"Alternate Realities","Description":"Roll twice on the World Chart. Both worlds are in play at the same time. If an effect changes the world, both worlds are replaced by the new one."},{"Roll":52,"Name":"","Description":"Any player may pay 6 during their main phase. That player shuffles their library and flips over the top card. If it is a permanent, that player may put it into play without paying the casting cost. If there is an X in the spell, X equal 1."},{"Roll":53,"Name":"Wishing Well","Description":"Any player may discard a card and pay 1 to untap target permanent."},{"Roll":54,"Name":"Sphere of Oppression","Description":"Any player may discard a card to tap target permanent."},{"Roll":55,"Name":"Limited Resources","Description":"At the beginning of each player's upkeep, that player must sacrifice a permanent if they control seven or more permanents."},{"Roll":56,"Name":"Benalish Archery Contest","Description":"Any player may pay 5 to destroy target creature with flying."},{"Roll":57,"Name":"Demonic Academy","Description":"Any player may pay 4, sacrifice a permanent, and discard a card to search their library for any card."},{"Roll":58,"Name":"Aether Portal","Description":"At the beginning of each player's upkeep, that player discards a card. If a permanent is discarded this way, put that card into play unless any player pays 3 life."},{"Roll":59,"Name":"Dueling Grounds","Description":"No more than one creature can attack or block each turn."},{"Roll":60,"Name":"Hall of Heroes","Description":"All creatures, artifacts, and enchantments are legends."},{"Roll":61,"Name":"Cloud Cover","Description":"Whenever a permanent becomes the target of a spell or effect, that permanent's controller may return it to their hand."},{"Roll":62,"Name":"Abyssal Void","Description":"If, at the beginning of any player's upkeep, they control no permanents and have no cards in hand, they win the game."},{"Roll":63,"Name":"Unstable Ground","Description":"Whenever a player plays a creature spell, that player returns a land they control to their hand."},{"Roll":64,"Name":"Mana Maze","Description":"Players can't play spells that share a color with the spell last played this turn."},{"Roll":65,"Name":"Gerrard's Lazy-Boy","Description":"Whenever a creature or land becomes tapped, put a laziness counter on it. Permanents with lazinesscounters on them do not untap as normal. At the beginning of each player's upkeep, that player removes all laziness counters."},{"Roll":66,"Name":"Realm of the Angels","Description":"Creatures do not tap to attack."},{"Roll":67,"Name":"Squirrel Farm","Description":"Whenever a player puts a creature card into play, each other player puts a green 1/1 squirrel token into play."},{"Roll":68,"Name":"Urza's Casino","Description":"Any player may pay 5 to search their library for any card and put it into their hand. They then must discard a card at random."},{"Roll":69,"Name":"Ivory Tower","Description":"At the beginning of each player's upkeep, that player gains life equal to the number of cards in one of their opponent's hands."},{"Roll":70,"Name":"Mishra's Interrogation Room","Description":"During each player's upkeep, that player takes damage equal to the their hand size minus 4."},{"Roll":71,"Name":"Yawgmoth's Torture Chamber","Description":"During each player's upkeep, that player takes damage equal to 3 minus their hand size."},{"Roll":72,"Name":"Mirror Universe","Description":"Whenever a creature is played, that player puts a token copy of that creature into play."},{"Roll":73,"Name":"Rebel Training Grounds","Description":"Any player may pay 5 to search their library for a creature card with converted mana cost of 3 or less. Put that card into play."},{"Roll":74,"Name":"Orim's Hospital","Description":"Any player may pay 3 and discard a card to prevent all damage from one source."},{"Roll":75,"Name":"Bodyguard's Guild","Description":"Any player may pay 2 and sacrifice a creature to prevent all damage from one source."},{"Roll":76,"Name":"School of Tim","Description":"Players may tap a creature they control to do a point of damage to target creature or player."},{"Roll":77,"Name":"Gladiator Arena","Description":"All creatures gain: \"Tap to deal damage equal to it's power to target creature. That creature does it's power in damage to the original creature."},{"Roll":78,"Name":"Circle of Quickening","Description":"Creature spells may be played as instants."},{"Roll":79,"Name":"Retrobutive Strike","Description":"Any player may sacrifice an artifact or enchantment to destroy a creature."},{"Roll":80,"Name":"Herd Lands","Description":"Whenever a player plays a creature card, that player may search their library for a card with the same creature type and put into their hand."},{"Roll":81,"Name":"Extreme Prejudice","Description":"Whenever a player plays a creature spell, put a +1/+1 counter on all creatures in play with a different creature type."},{"Roll":82,"Name":"Tangle Brush","Description":"Each player may only untap one creature per turn."},{"Roll":83,"Name":"Fault Line","Description":"Any player may discard a land from their hand to deal 2 damage to target creature or player."},{"Roll":84,"Name":"Prismatic Mist","Description":"Any player may pay 2 to change the color of target creature until end of turn."},{"Roll":85,"Name":"Mercadian Swap Meet","Description":"All cards gain Cycling:2."},{"Roll":86,"Name":"Phyrexian Vat Farms","Description":"At the beginning of each player's upkeep, that player may return a creature card from their graveyard into play."},{"Roll":87,"Name":"Impatience","Description":"At the end of each player's turns, that player must take 2 damage if they didn't play a spell this turn."},{"Roll":88,"Name":"Urza's Bargain","Description":"The casting cost of all spells are reduced by one."},{"Roll":89,"Name":"Ertai's Distraction","Description":"Permanents come into play tapped"},{"Roll":90,"Name":"Benalish Heroism","Description":"Creatures may block an additional creature during combat."},{"Roll":91,"Name":"Aether Barrier","Description":"Creature spells cost an additional 2 mana to cast."},{"Roll":92,"Name":"Time Vortex","Description":"Players take 2 turns instead of one. The player who goes first does not draw cards during the first or second of his/her draw phases."},{"Roll":93,"Name":"Urza's War Tax","Description":"Players must pay 2 mana for each attacking creature."},{"Roll":94,"Name":"Unclaimed Territory","Description":"During each player's upkeep, that player may search their library for a basic land card and put it into play tapped."},{"Roll":95,"Name":"Pale Moon","Description":"If a player taps a non-basic land for mana, that land produces colorless mana instead of it's normal type."},{"Roll":96,"Name":"Hanna's Wisdom","Description":"Whenever a permanent becomes targetted, the controller of that permanent draws a card."},{"Roll":97,"Name":"Red Tape","Description":"Whenever a player plays a spell, they must pay 1 additional mana, or all opponents draw a card."},{"Roll":98,"Name":"Urza's Palm Reading Shop","Description":"Any player may pay X to look at the top X cards in their library and put them back in any order."},{"Roll":99,"Name":"Fog Bank","Description":"Any player may sacrifice 2 lands to prevent all combat damage this turn."},{"Roll":100,"Name":"Plane Shift","Description":"Reroll 2 more times on the World Chart. Both worlds are considered in play simultaneously. If an Event changes the World, both worlds are replaced by the new one."}]